karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
#include <stdint.h>
#include "string.h"

#include "esp_log.h"

#include "driver/uart.h"
#include "driver/gpio.h"

#include "esp32_finger_print.h"

#define TXD_PIN (GPIO_NUM_44)                   //++ TX & RX pins for UART 1 on ESP32 Devkit v1
#define RXD_PIN (GPIO_NUM_43)

static const int RX_BUF_SIZE = 2048;            //++ UART RX Buffer Size
static const char *R307_TX = "R307_TX";         //++ UART RX TAG

void r307_response_parser(char instruction_code, uint8_t received_package[]);

void r307_init(void)                          
{
    const uart_config_t uart_config = 
    {
        .baud_rate = 57600,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_APB,
    };
    // We won't use a buffer for sending data.
    uart_driver_install(UART_NUM_1, RX_BUF_SIZE * 2, 0, 0, NULL, 0);
    uart_param_config(UART_NUM_1, &uart_config);
    uart_set_pin(UART_NUM_1, TXD_PIN, RXD_PIN, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
}

uint8_t r307_reponse(char instruction_code)
{
    uint8_t received_confirmation_code = 0xFF;
    uint8_t *received_package = (uint8_t *)malloc(RX_BUF_SIZE + 1);
    const int rxBytes = uart_read_bytes(UART_NUM_1, received_package, RX_BUF_SIZE, pdMS_TO_TICKS(3000));
     ESP_LOGI("R307_RX",
             "Received bytes: %d",
             rxBytes);
    if (rxBytes > 0)
    {
        received_package[rxBytes] = 0;
        // ESP_LOGI("R307_RX", "Read %d bytes: '%s'", rxBytes, received_package);
        ESP_LOG_BUFFER_HEXDUMP("R307_RX", received_package, rxBytes, ESP_LOG_INFO);     //++ Dumps the response in HEX format

        ESP_LOGI("R307_RX", 
         "Confirmation byte: 0x%02X",
         received_package[9]);

        received_confirmation_code = received_package[9];
        // r307_response_parser(instruction_code, received_package);                       //++ Pass the received response to the parser function
        // received_confirmation_code = received_package[9];                               //++ Get the Confirmation Code from received from the response

         ESP_LOGI("R307_RX",
                 "Confirmation code: 0x%02X",
                 received_confirmation_code);
    } else  {
        ESP_LOGE("R307_RX",
                 "No response from sensor");
    }
    free(received_package);

    return received_confirmation_code;
}

uint16_t check_sum(char tx_cmd_data[], char r307_data[])
{
    uint16_t result = 0;
    if(r307_data[0] == '#')                                                             //++ Check whether to perform checksum for packet without extra data inputs
    {
        char length[4];
        sprintf(length,"%c%c",r307_data[1],r307_data[2]);

        for(int i=0; i<atoi(length) - 8; i++)
        {
            result = result + tx_cmd_data[i+6];
        }
    }
    else                                                                                //++ Check whether to perform checksum for packet with extra data inputs
    {
        for(int i=0; i<4; i++)
        {
            result = result + tx_cmd_data[i+6];
            if(i<strlen(r307_data))
            {
                result = result + r307_data[i];
            }
        }
    }

    if(result <= 256)
    {    
        result = result % 256;
    }

    return result;
}

uint8_t VfyPwd(char r307_address[], char vfy_password[])
{
    char tx_cmd_data[16] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x07, 0x13};
    char check_sum_data[2] = {0x00, 0x1B};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, vfy_password);                     //++ Get the checksum result
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);                                 //++ Split checksum in Higher bits
    check_sum_data[1] = checksum_value & (0xFF);                                        //++ Split checksum in Lower bits

    for(int i=0; i<4; i++)                                                              //++ Loop to add module address and password 
    {
        tx_cmd_data[i+2] = r307_address[i];
        tx_cmd_data[i+10] = vfy_password[i];
        if(i<2)                                                                         //++ Loop to add checksum 
        {
            tx_cmd_data[i+14] = check_sum_data[i];
        }
    }

    char instruction_code;

    instruction_code = tx_cmd_data[9];                                                  //++ Get the Instruction Code

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);      //++ Send entire packet over UART

    ESP_LOGI(R307_TX, "VFVY PASS Wrote %d bytes", txBytes);

    ESP_LOG_BUFFER_HEXDUMP(R307_TX, tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t SetPwd(char r307_address[], char new_password[])
{
    char tx_cmd_data[16] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x07, 0x12};
    char check_sum_data[2] = {0x00, 0x1A};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, new_password);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        tx_cmd_data[i+10] = new_password[i];
        if(i<2)
        {
            tx_cmd_data[i+14] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);

    ESP_LOGI(R307_TX, "Set pwd Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

