karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    return confirmation_code;
}

uint8_t SetAdder(char r307_address[], char new_address[])
{
    char tx_cmd_data[16] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x07, 0x15};
    char check_sum_data[2] = {0x04, 0x19};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, new_address);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        tx_cmd_data[i+10] = new_address[i];
        if(i<2)
        {
            tx_cmd_data[i+14] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Set Addr Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t PortControl(char r307_address[], char control_code[])
{
    char tx_cmd_data[13] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x04, 0x17};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, control_code);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = control_code[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+11] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Port Control Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t ReadSysPara(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x0F, 0x00, 0x13};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Read sys para Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t TempleteNum(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x1D, 0x00, 0x21};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Template Num Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t GR_Auto(char r307_address[])
{
    char tx_cmd_data[17] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x08, 0x32, 0x20, 0x00, 0x00, 0x00, 0x00};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#17");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+15] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "GR Auto Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t GR_Identify(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x34};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

