karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "FR identify Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t GenImg(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x01};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Gen Img Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t UpImage(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x0A};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Up img Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(2000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t DownImage(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x0B};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Down Img Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t Img2Tz(char r307_address[], char buffer_id[])
{
    char tx_cmd_data[13] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x04, 0x02};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, buffer_id);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+11] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Im 2 z Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t RegModel(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x05};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Reg model Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t UpChar(char r307_address[], char buffer_id[])
{
    char tx_cmd_data[13] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x04, 0x08};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, buffer_id);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+11] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

