karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Upchar Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t DownChar(char r307_address[], char buffer_id[])
{
    char tx_cmd_data[13] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x04, 0x09};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, buffer_id);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+11] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Down Char Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t Store(char r307_address[], char buffer_id[], char page_id[])
{
    char tx_cmd_data[15] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x06, 0x06};
    char check_sum_data[2] = {0x00, 0x00};
    char combined_data[3] = {0x00, 0x00, 0x00};
    uint8_t confirmation_code = 0;

    memset(combined_data, 0, strlen(combined_data));
    strcat(combined_data, buffer_id);
    strcat(combined_data, page_id);

    uint16_t checksum_value = check_sum(tx_cmd_data, combined_data);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+13] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Store Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t LoadChar(char r307_address[], char buffer_id[], char page_id[])
{
    char tx_cmd_data[15] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x06, 0x07};
    char check_sum_data[2] = {0x00, 0x00};
    char combined_data[3] = {0x00, 0x00, 0x00};
    uint8_t confirmation_code = 0;

    memset(combined_data, 0, strlen(combined_data));
    combined_data[0] = buffer_id[0];
    combined_data[1] = page_id[0];
    combined_data[2] = page_id[1];

    uint16_t checksum_value = check_sum(tx_cmd_data, combined_data);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+13] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Load char Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t DeletChar(char r307_address[], char page_id[], char number_of_templates[])
{
    char tx_cmd_data[16] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x07, 0x0C, 0x00, 0x00, 0x00, 0x01, 0x00, 0x15};
    char check_sum_data[2] = {0x00, 0x00};
    char combined_data[4] = {0x00, 0x00, 0x00, 0x00};
    uint8_t confirmation_code = 0;

    memset(combined_data, 0, strlen(combined_data));
    for(int i=0; i<2; i++)
    {
        combined_data[i] = page_id[i];
        combined_data[i+2] = number_of_templates[i];
    }

    uint16_t checksum_value = check_sum(tx_cmd_data, combined_data);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = page_id[i];
            tx_cmd_data[i+12] = number_of_templates[i];
            tx_cmd_data[i+14] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Delete char Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t Empty(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x0D};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

