karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Empty Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t Match(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x03};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Match Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t Search(char r307_address[], char buffer_id[], char start_page[], char page_number[])
{
    char tx_cmd_data[17] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x08, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x0D};
    char check_sum_data[2] = {0x00, 0x00};
    char combined_data[5] = {0x00, 0x00, 0x00, 0x00, 0x00};
    uint8_t confirmation_code = 0;

    memset(combined_data, 0, strlen(combined_data));
    for(int i=0; i<2; i++)
    {
        combined_data[0] = buffer_id[0];
        combined_data[i+1] = start_page[i];
        combined_data[i+3] = page_number[i];
    }

    uint16_t checksum_value = check_sum(tx_cmd_data, combined_data);
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    tx_cmd_data[10] = buffer_id[0];
    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+11] = start_page[i];
            tx_cmd_data[i+13] = page_number[i];
            tx_cmd_data[i+15] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Search Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

uint8_t GetRandomCode(char r307_address[])
{
    char tx_cmd_data[12] = {0xEF, 0x01, 0xFF, 0xFF, 0xFF, 0xFF, 0x01, 0x00, 0x03, 0x14};
    char check_sum_data[2] = {0x00, 0x00};
    uint8_t confirmation_code = 0;

    uint16_t checksum_value = check_sum(tx_cmd_data, "#12");
    check_sum_data[0] = (checksum_value >> 8) & (0xFF);
    check_sum_data[1] = checksum_value & (0xFF);

    for(int i=0; i<4; i++)
    {
        tx_cmd_data[i+2] = r307_address[i];
        if(i<2)
        {
            tx_cmd_data[i+10] = check_sum_data[i];
        }
    }
    
    char instruction_code;

    instruction_code = tx_cmd_data[9];

    const int package_length = sizeof(tx_cmd_data);
    const int txBytes = uart_write_bytes(UART_NUM_1, tx_cmd_data, package_length);
    ESP_LOGI(R307_TX, "Get rand code Wrote %d bytes", txBytes);
    ESP_LOG_BUFFER_HEXDUMP("R307_TX", tx_cmd_data, package_length, ESP_LOG_INFO);
    vTaskDelay(1000 / portTICK_PERIOD_MS);

    confirmation_code = r307_reponse(instruction_code);

    return confirmation_code;
}

void r307_response_parser(char instruction_code, uint8_t received_package[])
{
    uint8_t confirmation_code = received_package[9];                                    //++ Get Confirmation Code from received response packet 

    if(instruction_code == 0x13)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("VfyPwd", "(0x00H) CORRECT PASSWORD\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("VfyPwd", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x13)
        {
            ESP_LOGE("VfyPwd", "(0x13H) WRONG PASSWORD\n");
        }
    }

    if(instruction_code == 0x12)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("SetPwd", "(0x00H) NEW PASSWORD COMPLETE\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("SetPwd", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
    }

    if(instruction_code == 0x15)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("SetAdder", "(0x00H) ADDRESS SETTING COMPLETE\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("SetAdder", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
    }

    if(instruction_code == 0x17)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("PortControl", "(0x00H) PORT OPERATION COMPLETE\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("PortControl", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x1D)
        {
            ESP_LOGE("PortControl", "(0x01DH) FAIL TO OPERATE PORT\n");
        }
    }

    if(instruction_code == 0x0F)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("ReadSysPara", "(0x00H) SYSTEM READ COMPLETE");

            ESP_LOGW("SYSTEM PARAMETER", "Library Size - %x:%x", received_package[14],received_package[15]);
            ESP_LOGW("SYSTEM PARAMETER", "Security Level - %x", received_package[17]);
            ESP_LOGW("SYSTEM PARAMETER", "32bit Address - %x:%x:%x:%x", received_package[18], received_package[19], received_package[20], received_package[21]);
            ESP_LOGW("SYSTEM PARAMETER", "Size Code - %x", received_package[23]);
            ESP_LOGW("SYSTEM PARAMETER", "N - %x\n", received_package[25]);
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("ReadSysPara", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
    }

