karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    if(instruction_code == 0x1D)
    {
        if(confirmation_code == 0x00)
        {
            uint16_t template_number = 0;
            ESP_LOGI("TempleteNum", "(0x00H) READ COMPLETE");

            template_number = received_package[10] + received_package[11];
            ESP_LOGW("SYSTEM PARAMETER", "Template Number - %d\n", template_number);
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("TempleteNum", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
    }

    if(instruction_code == 0x32 || instruction_code == 0x34)
    {
        if(confirmation_code == 0x00)
        {
            uint16_t page_id = 0;
            uint16_t match_score = 0;
            ESP_LOGI("GR_Auto", "(0x00H) READ COMPLETE");

            page_id = received_package[10] + received_package[11];
            match_score = received_package[12] + received_package[13];
            ESP_LOGW("SYSTEM PARAMETER", "Page ID - %d", page_id);
            ESP_LOGW("SYSTEM PARAMETER", "Match Score - %d\n", match_score);
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("GR_Auto/GR_Identify", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x06)
        {
            ESP_LOGE("GR_Auto/GR_Identify", "(0x06H) FINGERPRINT IMAGE GENERATION FAIL\n");
        }
        else if(confirmation_code == 0x07)
        {
            ESP_LOGE("GR_Auto/GR_Identify", "(0x07H) FINGERPRINT IMAGE GENERATION FAIL\n");
        }
        else if(confirmation_code == 0x09)
        {
            ESP_LOGE("GR_Auto/GR_Identify", "(0x09H) NO MATCHING FINGERPRINT\n");
        }
    }

    if(instruction_code == 0x01)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("GenImg", "(0x00H) FINGER COLLECTION SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("GenImg", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x02)
        {
            ESP_LOGE("GenImg", "(0x02H) NO FINGER DETECED\n");
        }
        else if(confirmation_code == 0x03)
        {
            ESP_LOGE("GenImg", "(0x03H) FAIL TO COLLECT FINGER\n");
        }
    }

    if(instruction_code == 0x0A)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("UpImage", "(0x00H) READY TO TRANSFER PACKET\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("UpImage", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0F)
        {
            ESP_LOGE("UpImage", "(0x0FH) FAILED TO TRANSFER PACKET\n");
        }
    }

    if(instruction_code == 0x0B)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("DownImage", "(0x00H) READY TO TRANSFER PACKET\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("DownImage", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0E)
        {
            ESP_LOGE("DownImage", "(0x0EH) FAILED TO TRANSFER PACKET\n");
        }
    }

    if(instruction_code == 0x02)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("Img2Tz", "(0x00H) GENERATE CHARACTER FILE COMPLETE\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("Img2Tz", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x06)
        {
            ESP_LOGE("Img2Tz", "(0x06H) FAILED TO GENERATE CHARACTER FILE\n");
        }
        else if(confirmation_code == 0x07)
        {
            ESP_LOGE("Img2Tz", "(0x07H) FAILED TO GENERATE CHARACTER FILE\n");
        }
        else if(confirmation_code == 0x15)
        {
            ESP_LOGE("Img2Tz", "(0x15H) FAILED TO GENERATE IMAGE\n");
        }
    }

    if(instruction_code == 0x05)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("RegModel", "(0x00H) OPERATION SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("RegModel", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0A)
        {
            ESP_LOGE("RegModel", "(0x0AH) FAILED TO COMBINE CHARACTER FILES\n");
        }
    }

    if(instruction_code == 0x08)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("UpChar", "(0x00H) READY TO TRANSFER\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("UpChar", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0D)
        {
            ESP_LOGE("UpChar", "(0x0DH) ERROR UPLOADING TEMPLATE\n");
        }
    }

    if(instruction_code == 0x09)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("DownChar", "(0x00H) READY TO TRANSFER\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("DownChar", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0E)
        {
            ESP_LOGE("DownChar", "(0x0EH) FAILED TO RECEIVE PACKAGES\n");
        }
    }

    if(instruction_code == 0x06)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("Store", "(0x00H) STORAGE SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("Store", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0B)
        {
            ESP_LOGE("Store", "(0x0BH) ADDRESSED PAGE ID IS BEYOND LIMIT\n");
        }
        else if(confirmation_code == 0x18)
        {
            ESP_LOGE("Store", "(0x18H) ERROR WRITING FLASH\n");
        }
    }

    if(instruction_code == 0x07)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("LoadChar", "(0x00H) LOAD SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("LoadChar", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x0C)
        {
            ESP_LOGE("LoadChar", "(0x0CH) ERROR READING TEMPLATE FROM LIBRARY\n");
        }
        else if(confirmation_code == 0x0B)
        {
            ESP_LOGE("LoadChar", "(0x0BH) ADDRESSED PAGE ID IS BEYOND LIMIT\n");
        }
    }

