karanrobo/LuminoPal/esp32_lamp/main/unused/esp32_finger_print.c
    if(instruction_code == 0x0C)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("DeletChar", "(0x00H) DELETE SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("DeletChar", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x10)
        {
            ESP_LOGE("DeletChar", "(0x10H) FAIL TO DELETE TEMPLATE\n");
        }
    }

    if(instruction_code == 0x0D)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("Empty", "(0x00H) EMPTY SUCCESS\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("Empty", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x11)
        {
            ESP_LOGE("Empty", "(0x11H) FAIL TO CLEAR LIBRARY\n");
        }
    }

    if(instruction_code == 0x03)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("Match", "(0x00H) TWO TEMPLATE BUFFERS MATCH\n");
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("Match", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x08)
        {
            ESP_LOGE("Match", "(0x08H) TWO TEMPLATES BUFFER UNMATHED\n");
        }
    }

    if(instruction_code == 0x04)
    {
        if(confirmation_code == 0x00)
        {
            uint16_t page_id = 0;
            uint16_t match_score = 0;
            ESP_LOGI("Search", "(0x00H) FOUND MATCHING FINGER");

            page_id = received_package[10] + received_package[11];
            match_score = received_package[12] + received_package[13];
            ESP_LOGW("SYSTEM PARAMETER", "Page ID - %d", page_id);
            ESP_LOGW("SYSTEM PARAMETER", "Match Score - %d\n", match_score);
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("Search", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
        else if(confirmation_code == 0x09)
        {
            ESP_LOGE("Search", "(0x09H) NO MATCHING FINGER IN LIBRARY\n");
        }
    }

    if(instruction_code == 0x14)
    {
        if(confirmation_code == 0x00)
        {
            ESP_LOGI("GetRandomCode", "(0x00H) GENERATION SUCCESSFUL");

            ESP_LOGW("GetRandomCode", "RANDOMLY GENERATED NUMBER - %x:%x:%x:%x\n", received_package[10], received_package[11], received_package[12],received_package[13]);
        }
        else if(confirmation_code == 0x01)
        {
            ESP_LOGE("GetRandomCode", "(0x01H) ERROR RECEIVING PACKAGE\n");
        }
    }

}
